1.Реализовать калькулятор с
4
методами: Сумма, вычитаниеб, умножение, деление.Метод
принимает
2
аргумента
и
возвращает
результат.Невалидные
данные
должны
быть
обработаны
2.
Вы
идете
в
путешествие, надо
подсчитать
сколько
у
денег
у
каждого
студента.Класс
студен
описан
следующим
образом:

Необходимо
понять
у
кого
больше
всего
денег
и
вернуть
его
имя.Если
у
студентов
денег
поровну
вернуть: “all”.
3.
метод
sum(a, b)
принимает
2
числа
и
возвращает
их
сумму.Написать
декоратор, который
возвращает
ошибку
если
переданы
нечисловые
параметры(например
строка)
примерно
такое:

4.
Создайте
класс
Students, содержащий
поля: фамилия
и
инициалы, номер
группы,
успеваемость(массив
из
пяти
элементов).
Создать
класс
School:
Добавить
возможно
для
добавления
студентов
в
школу
Добавить
возможность
вывода
фамилий
и
номеров
групп
студентов, имеющих
оценки, равные
только
5
или
6.
Добавить
возможность
вывода
учеников
заданной
группы
Добавить
возможность
вывода
учеников
претендующих
на
автомат(средний
балл >= 7)
5.
Создайте
класс
Робот
создайте
2
типа
оружия: меч, автомат
Создайте
2
типа
амуниции: броня, шлем
Добавьте
оружию
и
амуниции
свои
характеристики(например
урон, прочность)
Создайте
своего
робота
с
каким
либо
оружием
(может быть несколько и брони может быть несколько.Так же может быть ничего)
Выведите
весь
арсенал
робота
на
экран
6.
Шахматный
король
ходит
по
горизонтали, вертикали
и
диагонали,
но
только
на
1
клетку.Даны
две
различные
клетки
шахматной
доски,
определите, может
ли
король
попасть
с
первой
клетки
на
вторую
одним
ходом.
Пример
Cell
1
coordinates:
4, 4
Cell
2
coordinated:
5, 5
YES
Конь
Определите, может
ли
конь
попасть
с
первой
клетки
на
вторую
одним
ходом.
Ладья
Определите, может
ли
ладья
попасть
с
первой
клетки
на
вторую
одним
ходом.
Ферзь
Определите, может
ли
ферзь
попасть
с
первой
клетки
на
вторую
одним
ходом.
Слон
определите, может
ли
слон
попасть
с
первой
клетки
на
вторую
одним
ходом.
7.
Создать
4
фрукта.
Апельсин, яблоко, мандарин, банан
У
всех
фруктов
есть
сорт, список
витаминов, цена, имя
У
апельсина, мандарина, банана
есть
метод
очистить
У
яблока
метод
порезать
У
банана
есть
характеристика: кол - во
калия
Создать
4
объекта
фрукта
и
использовать
все
доступные
методы
и
характеристики
При
вызове
метода
очистить, должно
писаться
имя
фрукта
Например: