#Файл-это набор данных, сохранен.в виде последовательности битов на компьютер.
# Информ.хранится в куче данных и имеет название (имя файла).
# Два типа файлов: - текстовый и бинарный.
# Текстовый -файл с содержимым.Хранятся последовательности символов,
# которые мы понимаем.Блокнот и другие станд.редакторы умеют читать и редактировать.
# Текст храниться в формате txt -простой текст.
# Бинарные файлы отображаютя в закодированных формах (использ.только 0 и 1).Храняться в формате bin.
# Любую опирацию можно разбить на три крупных этапа:
# - открытиефайла
# - выполнение операции(запись,чтение)
# - закрытие файлаю Метод Open() С ее помощью можно открыть любой файл на компьютере.
#f = open(file_name, access_mode), где file_name - имя откр.файла, access_mode - режим открытия

