# Зад.1
# Найти самое длинное слово в строке.
#
# a = input('Введите строку:\n')
# b = a.split()
# c = sorted(b, key=len)
# print('Самое длинное слов:', c[-1])

# # Зад.2
# # Преобразовать текст в список слов с удалением знаков препинания.
#
# a = input('Введите строку из нескольких слов:\n')
# b = '''!?@#$%:()-[]{};'"\,./^&amp;*_'''
# for i in b:
#     if i in a:
#         a = a.replace(i,'')
# c = a.split()
# print('Ваша строка без знаков припенания:\n', c)

#Закрепление темы:
# Создайте кортеж с цифрами от 0 до 9 и поcчитайте сумму

# from random import randint
# a = [randint(0,9) for i in range(10)]
# b = tuple(a)
# print('b= ', b, 'Sum = ', sum(b))

#  Выведите статистику частности букв в кортеже

# a = ('т', 'т', 'а', 'и', 'и', 'а', 'и', 'и', 'и','т', 'т', 'а', 'и', 'и', 'и', 'и', 'и', 'т', 'и')
# print('т =', a.count('т'))
# print('а =', a.count('а'))
# print('и =', a.count('и'))

# # Допишите скрипт для расчета средней температуры
#
# week_temp = (26, 29, 34, 32, 28, 26, 23)
# sum_temp = sum(week_temp)
# days = len(week_temp)
# mean_temp = sum_temp / days
# print(int(mean_temp))
