a = "Всё самое лучшее случается неожиданно"    # строка
print(a[2])      #1 третий символ
print(a[-2])     #2 предпоследний символ
print(a[:5])   #3 первые пять символов
print(a[0:-2])   #4 вся строка,кроме двух последних символов
print(a[::2])   #5 все символы с четными индексами (начиная с первого)
print(a[1::2])   #6 все символы с нечетными индексами (начиная со второго)
print(a[::-1])   #7 все символы в обратн.порядке
print(a[::-2])   #8 все символы через один в обратн.порядке
print(len(a))   #9 длина строки


