#Дан список цветов 'red' 'green' 'white' 'black' 'pink'  'yellow'.
# Создате дополнительны список  и переместите в него  1, 5 и 6 элемент
elements = ['red', 'green', 'white', 'black', 'pink', 'yellow']
a1 = [elements[0], elements[4], elements[5]]
print(a1)
