#Создать переменные a,b,c и присвоить им значение 9,17 и 5 соответственно.Проверить выполнение следующих условий
# а больше b; a не равно разности b и c; b =a+c; c>=a+b;a>b a<c; b<a b<c
a = 9
b = 17
c = 5
print(a < b)
print(a != b - c)
print(b == a + c)
print(c > a + b)
print(a > b  and a < c)
print(b < a  and b < c)
