#зад.1
# person = {'name': {'Вася', 'Петя', 'Коля'},
#           'age': {'13', '18', '30'},
#           'city': {'Минск'}}
# print(person['age'})
#зад.2
# a = {'BMW': [1, 2, 3], 'Tesla': [1, 2, 3]}
# print(a['BMW'][0], a['BMW'][-1])
# print(a['Tesla'][0], a['Tesla'][-1])
#зад.3
# d1 = {"a": 100, "b": 200, "c": 300}
# d2 = {"a": 300, "b": 200, "c": 400}
# print(d1["b"] == d2["b"])
#зад.4 дан словарь с исловым значением, необходимо их все перемножить и вывести на экран
# a = {1: 2, 2: 4, 3: 9, 4: 5, 5: 6}
# c = 1
# for i in a:
#     c = c * a[i]
# print(c)
#зад.5 даны
a = dict(zip([1, 2, 3, 4], ['Red', 'Blue', 'Yello', 'Green']))
print(a)