# 2. Дан список некоторых целых чисел,
# найдите значение 20 в нем и замените его на 200.
list = [1, 5, 18, 20, -99, 'ha']
for i in list:
    if i == 20:
        i1 = list.index(i)
        list[i1] = 200
print(list)