# Задание №1
# Найти самое длинное слово в строке.

# s = input('Введите строку из нескольких слов:\n')
# a = s.split()
# b = sorted(a, key=len)
# print('Самое длинное слов:', b[-1])

# Задание №2
# Преобразовать текст в список слов с удалением знаков препинания.

# s = input('Введите строку из нескольких слов:\n')
# znaki = '''!()-[]{};?@#$%:'"\,./^&amp;*_'''
# for i in znaki:
#     if i in s:
#         s = s.replace(i,'')
# a = s.split()
# print('Ваша строка без знаков припенания:\n', a)