#1 Найти самое длинное слово в строке.
# word = input('Введите несколько слов  через пробел: ')
# a = word.split()
# a_sorted = sorted(a, key=len)
# print('Самое длинное слово -->',a_sorted[-1])

# #2 Преобразовать текст в список слов с удалением знаков препинания.
#
# punctuations = '''!()-[]{};:'"\,<>./?@#$%^&*_~'''
#
# str = input("Введи строку: ")
#
# no_punct = ""
# for i in str:
#    if i not in punctuations:
#        no_punct = no_punct + i
#
# print(no_punct)